benchmark_results/simple_2t_50c_20260118_102225.txt
Running 10s test @ http://127.0.0.1:8000/dev/benchmark-api?mode=simple
  2 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   290.11ms  173.97ms   1.19s    92.46%
    Req/Sec   100.80     32.58   170.00     73.08%
  Latency Distribution
     50%  224.31ms
     75%  272.50ms
     90%  408.75ms
     99%    1.12s 
  1842 requests in 10.07s, 2.24MB read
Requests/sec:    182.94
Transfer/sec:    228.12KB