benchmark_results/simple_4t_200c_20260118_090633.txt
Running 30s test @ http://127.0.0.1:8000/dev/benchmark-api?mode=simple
  4 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   436.30ms   67.34ms 732.76ms   83.04%
    Req/Sec   115.45     80.67   420.00     63.70%
  Latency Distribution
     50%  416.11ms
     75%  457.86ms
     90%  525.35ms
     99%  664.96ms
  13561 requests in 30.06s, 14.68MB read
Requests/sec:    451.20
Transfer/sec:    500.10KB